OpenFOAM-6/02-examples/pimpleFoam/dropletAero2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "parameters"

// number of nodes on each section
// numerical values as #calc not working
nx1 203;//#calc "static_cast<int>(floor(abs($x1 - $x0) / $dx))";
nx2 13;//#calc "static_cast<int>(floor(abs($x2 - $x1) / $dx))";
nx3 203;//#calc "static_cast<int>(floor(abs($x3 - $x2) / $dx))";
ny1 20;//#calc "static_cast<int>(floor(abs($y1 - $y0) / $dy))";
nz  1;//#calc "static_cast<int>(floor(abs($z1 - $z0) / $dz))";

convertToMeters 1.0e-3;

vertices
(
    ($x0 $y0 $z0)
    ($x1 $y0 $z0)
    ($x2 $y0 $z0)
    ($x3 $y0 $z0)

    ($x0 $y1 $z0)
    ($x1 $y1 $z0)
    ($x2 $y1 $z0)
    ($x3 $y1 $z0)

    ($x0 $y0 $z1)
    ($x1 $y0 $z1)
    ($x2 $y0 $z1)
    ($x3 $y0 $z1)

    ($x0 $y1 $z1)
    ($x1 $y1 $z1)
    ($x2 $y1 $z1)
    ($x3 $y1 $z1)
);

blocks
(
    hex (0 1 5 4 8 9 13 12) ($nx1 $ny1 $nz) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13) injectionZone ($nx2 $ny1 $nz) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) ($nx3 $ny1 $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top1_half0
    {
        type    empty;
        neighbourPatch    top1_half1;
        faces
        (
            (1 0 4 5)
        );
    }

    top2_half0
    {
        type    empty;
        neighbourPatch    top2_half1;
        faces
        (
            (2 1 5 6)
        );
    }

    top3_half0
    {
        type    empty;
        neighbourPatch    top3_half1;
        faces
        (
            (3 2 6 7)
        );
    }

    top1_half1
    {
        type    empty;
        neighbourPatch    top1_half0;
        faces
        (
            (8 9 13 12)
        );
    }

    top2_half1
    {
        type    empty;
        neighbourPatch    top2_half0;
        faces
        (
            (9 10 14 13)
        );
    }

    top3_half1
    {
        type    empty;
        neighbourPatch    top3_half0;
        faces
        (
            (10 11 15 14)
        );
    }

    inlet
    {
        type    patch;
        faces
        (
            (0 8 12 4)
        );
    }

    outlet
    {
        type    patch;
        faces
        (
            (3 7 15 11)
        );
    }

    injector
    {
        type    patch;
        faces
        (
            (5 13 14 6)
        );
    }

    wall
    {
        type    patch;
        faces
        (
            (4 12 13 5)
            (6 14 15 7)
        );
    }

    paper
    {
        type    patch;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
        );
    }

);
mergePatchPairs
(
);

// ************************************************************************* //
