OpenFOAM-6/02-examples/pimpleFoam/dropletAero2D/0.org/initialCondition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "0";
    object      initialCondition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

velocity #codeStream
{
    code
    #{
        double PPS = 2.0e-3;
        double Umax = 0.5;
        const IOdictionary& d = dynamicCast<const IOdictionary>(dict);
        const objectRegistry& db = d.db();

        volVectorField& fld =
            const_cast<volVectorField&>(db.lookupObject<volVectorField>("U"));

        const fvMesh& mesh =  fld.mesh();

        // to set a position-dependent value
        forAll(mesh.C(), i)
        {
            double yloc = mesh.C()[i].y();
            fld[i] = vector(-Umax * yloc / PPS, 0.0, 0.0);
        }
        os << fld.internalField();
    #};

   codeInclude
    #{
        #include "fvCFD.H"
    #};
 
    codeOptions
    #{
        -I$(LIB_SRC)/meshTools/lnInclude \
        -I$(LIB_SRC)/finiteVolume/lnInclude
    #};

     codeLibs
     #{
          -lfiniteVolume \
          -lmeshTools
     #};
};

#inputMode merge
