OpenFOAM-6/02-examples/pimpleFoam/dropletAero2D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "parameters"

xb0 #calc "1.0e-3 * $x1";
xb1 #calc "1.0e-3 * $x2";
yb0 #calc "1.0e-3 * $y0";
yb1 #calc "1.0e-3 * $y1";
zb0 #calc "1.0e-3 * $z0";
zb1 #calc "1.0e-3 * $z1";
actions
(
    {
        name    wall;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name wall;
        }
    }
    {
        name    wallFaceZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet wall;
        }
    }

    {
        name    outlet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name outlet;
        }
    }
    {
        name    outletFaceZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet outlet;
        }
    }

    {
        name    paper;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name paper;
        }
    }
    {
        name    paperFaceZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet paper;
        }
    }

    {
        name    injectionCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box ($xb0 $yb0 $zb0) ($xb1 $yb1 $zb1);
        }
    }
);

// ************************************************************************* //
